In [4]:
import pandas as pd
import psycopg2
pd.set_option("display.max_columns", None)
pd.set_option("display.max_rows", None)

In [5]:
engine = create_engine('postgresql://postgres:postgres@localhost:5442/ny_taxi')

### Question 3: How many taxi trips were there on January 15?

In [49]:
pd.read_sql(
"""
SELECT COUNT(*)
FROM   ny_taxi nt
WHERE  nt.tpep_pickup_datetime::DATE = '2022-01-15'::DATE; 
""", engine)

   count
0  88704

### Question 4: Find the largest tip for each day. On which day it was the largest tip in January?

In [50]:
pd.read_sql(
"""
SELECT   MAX(nt.tip_amount) AS max_tip,
         nt.TPEP_PICKUP_DATETIME::DATE AS pickup_date
FROM     ny_taxi nt
WHERE    nt.TPEP_PICKUP_DATETIME::DATE BETWEEN '2022-01-01'::DATE AND '2022-01-31'::DATE
GROUP BY nt.TPEP_PICKUP_DATETIME::DATE
ORDER BY max(nt.tip_amount) DESC
LIMIT 5;
""", engine)

   max_tip pickup_date
0   888.88  2022-01-29
1   303.00  2022-01-15
2   301.00  2022-01-16
3   250.00  2022-01-23
4   245.83  2022-01-27

### Question 5: What was the most popular destination for passengers picked up in central park on January 14?

In [51]:
pd.read_sql(
"""
SELECT   COALESCE(z1.zone,'UNKNOWN') AS src_zone,
         COALESCE(z2.zone, 'UNKNOWN') AS dest_zone,
         COUNT(z2.zone)
FROM     ny_taxi nt
JOIN     zones z1
ON       nt.pulocationid = z1.locationid
JOIN     zones z2
ON       nt.dolocationid = z2.locationid
WHERE    z1.zone = 'Central Park'
AND      nt.TPEP_PICKUP_DATETIME::DATE ='2022-01-14'::DATE
GROUP BY z1.zone,
         z2.zone
ORDER BY count(z2.zone) DESC
LIMIT 5;
""", engine)

       src_zone              dest_zone  count
0  Central Park  Upper East Side South    108
1  Central Park  Upper East Side North    100
2  Central Park         Midtown Center     99
3  Central Park    Lincoln Square East     94
4  Central Park           Central Park     88

### Question 6: What's the pickup-dropoff pair with the largest average price for a ride (calculated based on total_amount)?

In [52]:
pd.read_sql(
"""
SELECT CONCAT(COALESCE(z1.zone, 'UNKNOWN'), '/', COALESCE(z2.zone, 'UNKNOWN')) as trip, AVG(nt.total_amount) as avg_price
FROM   ny_taxi nt
       LEFT JOIN zones z1
              ON nt.pulocationid = z1.locationid
       LEFT JOIN zones z2
              ON nt.dolocationid = z2.locationid
GROUP  BY z1.zone,
          z2.zone
ORDER  BY AVG(nt.total_amount) DESC
LIMIT 5; 
""", engine)

                                 trip   avg_price
0  Marine Park/Floyd Bennett Field/NV  688.350000
1                Bedford Park/UNKNOWN  381.140000
2   Prospect-Lefferts Gardens/UNKNOWN  328.070000
3         Howard Beach/Newark Airport  324.720000
4            Gramercy/Lenox Hill East  311.386154